<a href="https://colab.research.google.com/github/victorog17/soulcode_projeto_pandas_spark/blob/main/001_Mini_Projeto_Soul_Epata_Pandas_COLAB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **0. IMPORTS**

**BIBLIOTECAS**

In [ ]:
import pandas as pd
import numpy as np

**CARREGANDO DATASET**

In [ ]:
df = pd.read_csv('https://storage.googleapis.com/bucket-mini-projeto-final-soulcode-victor/base_de_dados/marketing_campaign.csv', sep=',')
df.head()

     ID  Year_Birth   Education  ... Z_CostContact  Z_Revenue  Response
0  5524        1957  Graduation  ...             3         11         1
1  2174        1954  Graduation  ...             3         11         0
2  4141        1965  Graduation  ...             3         11         0
3  6182        1984  Graduation  ...             3         11         0
4  5324        1981         PhD  ...             3         11         0

[5 rows x 29 columns]

# **1. DESCRIÇÃO DOS DADOS**

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

**VERIFICANDO NOMES DAS COLUNAS**

In [ ]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

**Criando listas com os nomes originais das colunas e os novos nomes a serem substituidos**

In [ ]:
col_originais = ['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response']

col_novas = ['id', 'ano_nasc', 'educacao', 'status_civil', 'renda_anual', 'qtd_crianca',
        'qtd_adolescente', 'data_primeira_compra', 'dias_ultima_compra', 'gasto_em_vinhos', 'gasto_em_frutas',
        'gasto_em_carnes', 'gasto_em_peixes', 'gasto_em_doces', 'gasto_em_ouro', 'num_compras_desconto',
        'num_compras_online', 'num_compras_catalogo', 'num_compras_loja', 'num_visitas_online_mensal',
        'oferta_aceito3', 'oferta_aceito4', 'oferta_aceito5', 'oferta_aceito1', 'oferta_aceito2',
        'reclamacoes', 'z_custo_contato', 'z_receita', 'resposta']

# **2. INICIO MODIFICAÇÕES**

In [ ]:
df2 = df.copy()

**RENOMEANDO AS COLUNAS**

In [ ]:
df2.columns = col_novas

In [ ]:
df2.sample()

       id  ano_nasc educacao  ... z_custo_contato  z_receita  resposta
441  7495      1948      PhD  ...               3         11         0

[1 rows x 29 columns]

**CRIANDO LISTAS PARA SUBSTITUIR OS VALORES EM INGLÊS DAS COLUNAS PARA PORTUGUÊS E TROCAR AS OPÇÕES DE 0 E 1 PARA SIM E NÃO**

In [ ]:
educacao_antigo = ['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle']
educacao_novo = ['graduacao', 'doutorado', 'mestrado', 'ensino_fundamental', 'ensino_medio']

civil_antigo = ['Single', 'Together', 'Married', 'Divorced', 'Widow', 'Alone', 'Absurd', 'YOLO']
civil_novo = ['solteiro', 'uniao_estavel', 'casado', 'divorciado', 'viuvo', np.NaN, np.NaN, np.NaN]

cmp_antigo = [0, 1]
cmp_novo = ['nao', 'sim']

**SUBSTITUIÇÃO DOS DADOS, PELAS INFORMAÇÕES DAS LISTAS E CONVERSÃO DO CAMPO 'DATA_PRIMEIRA_COMPRA' PARA DATETIME**

In [ ]:
df2['educacao'] = df2['educacao'].replace(educacao_antigo, educacao_novo)
df2['status_civil'] = df2['status_civil'].replace(civil_antigo, civil_novo)
df2['oferta_aceito1'] = df2['oferta_aceito1'].replace(cmp_antigo, cmp_novo)
df2['oferta_aceito2'] = df2['oferta_aceito2'].replace(cmp_antigo, cmp_novo)
df2['oferta_aceito3'] = df2['oferta_aceito3'].replace(cmp_antigo, cmp_novo)
df2['oferta_aceito4'] = df2['oferta_aceito4'].replace(cmp_antigo, cmp_novo)
df2['oferta_aceito5'] = df2['oferta_aceito5'].replace(cmp_antigo, cmp_novo)
df2['reclamacoes'] = df2['reclamacoes'].replace(cmp_antigo, cmp_novo)
df2['resposta'] = df2['resposta'].replace(cmp_antigo, cmp_novo)
df2['data_primeira_compra'] = pd.to_datetime(df2['data_primeira_compra'])
df2.head()

     id  ano_nasc   educacao  ... z_custo_contato  z_receita  resposta
0  5524      1957  graduacao  ...               3         11       sim
1  2174      1954  graduacao  ...               3         11       nao
2  4141      1965  graduacao  ...               3         11       nao
3  6182      1984  graduacao  ...               3         11       nao
4  5324      1981  doutorado  ...               3         11       nao

[5 rows x 29 columns]

**VERIFICAÇÃO DOS DADOS NO FIM DA SEGUNDA ETAPA**

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   id                         2240 non-null   int64
 1   ano_nasc                   2240 non-null   int64
 2   educacao                   2240 non-null   object
 3   status_civil               2233 non-null   object
 4   renda_anual                2216 non-null   float64
 5   qtd_crianca                2240 non-null   int64
 6   qtd_adolescente            2240 non-null   int64
 7   data_primeira_compra       2240 non-null   datetime64[ns]
 8   dias_ultima_compra         2240 non-null   int64
 9   gasto_em_vinhos            2240 non-null   int64
 10  gasto_em_frutas            2240 non-null   int64
 11  gasto_em_carnes            2240 non-null   int64
 12  gasto_em_peixes            2240 non-null   int64
 13  gasto_em_doces             2240 non-null   int64
 14  gasto_em_ouro              2240 non-null   int64
 15  num_compras_desconto       2240 non-null   int64
 16  num_compras_online         2240 non-null   int64
 17  num_compras_catalogo       2240 non-null   int64
 18  num_compras_loja           2240 non-null   int64
 19  num_visitas_online_mensal  2240 non-null   int64
 20  oferta_aceito3             2240 non-null   object
 21  oferta_aceito4             2240 non-null   object
 22  oferta_aceito5             2240 non-null   object
 23  oferta_aceito1             2240 non-null   object
 24  oferta_aceito2             2240 non-null   object
 25  reclamacoes                2240 non-null   object
 26  z_custo_contato            2240 non-null   int64
 27  z_receita                  2240 non-null   int64
 28  resposta                   2240 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(18), object(9)
memory usage: 507.6+ KB

# **3. REMOÇÃO DE NAN**

In [ ]:
df3 = df2.copy()

In [ ]:
df3.dropna(subset=['status_civil'], inplace = True)
df3.dropna(subset=['renda_anual'], inplace = True)

In [ ]:
df3['z_custo_contato'].unique()

array([3])

In [ ]:
df3['z_receita'].unique()

array([11])

**COMO AS COLUNAS "Z_CUSTO_CONTATO" E "Z_RECEITA" TINHAM EXCLUSIVAMENTE 1 VALOR EM CADA UMA, FORAM REMOVIDAS, POIS INTERPRETEI QUE NÃO HÁ SENTIDO EM MANTER UMA INFORMAÇÃO QUE É EXATAMENTE A MESMA PARA TODOS OS DADOS**

In [ ]:
df3.drop(['z_custo_contato', 'z_receita'], axis=1, inplace=True)

**REMOÇÃO DAQUELES QUE NASCERAM ANTES DE 1914**

In [ ]:
df3[df3['ano_nasc'] < 1914]

        id  ano_nasc      educacao  ... oferta_aceito2  reclamacoes  resposta
192   7829      1900  ensino_medio  ...            nao          sim       nao
239  11004      1893  ensino_medio  ...            nao          nao       nao
339   1150      1899     doutorado  ...            nao          nao       nao

[3 rows x 27 columns]

In [ ]:
df3.drop([192, 239, 339], inplace=True)

**DESCRIÇÃO FINAL DOS DADOS**

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2206 entries, 0 to 2239
Data columns (total 27 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   id                         2206 non-null   int64
 1   ano_nasc                   2206 non-null   int64
 2   educacao                   2206 non-null   object
 3   status_civil               2206 non-null   object
 4   renda_anual                2206 non-null   float64
 5   qtd_crianca                2206 non-null   int64
 6   qtd_adolescente            2206 non-null   int64
 7   data_primeira_compra       2206 non-null   datetime64[ns]
 8   dias_ultima_compra         2206 non-null   int64
 9   gasto_em_vinhos            2206 non-null   int64
 10  gasto_em_frutas            2206 non-null   int64
 11  gasto_em_carnes            2206 non-null   int64
 12  gasto_em_peixes            2206 non-null   int64
 13  gasto_em_doces             2206 non-null   int64
 14  gasto_em_ouro              2206 non-null   int64
 15  num_compras_desconto       2206 non-null   int64
 16  num_compras_online         2206 non-null   int64
 17  num_compras_catalogo       2206 non-null   int64
 18  num_compras_loja           2206 non-null   int64
 19  num_visitas_online_mensal  2206 non-null   int64
 20  oferta_aceito3             2206 non-null   object
 21  oferta_aceito4             2206 non-null   object
 22  oferta_aceito5             2206 non-null   object
 23  oferta_aceito1             2206 non-null   object
 24  oferta_aceito2             2206 non-null   object
 25  reclamacoes                2206 non-null   object
 26  resposta                   2206 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(16), object(9)
memory usage: 482.6+ KB

# **4. SALVANDO ARQUIVO NO DRIVE**

**SALVANDO NO DRIVE**

In [ ]:
#df3.to_csv('/content/drive/MyDrive/Soul_Code_Academy/repositorio_mini_projeto/marketing_campaign_tratado_pandas.csv', sep=',', index=False)

**SALVANDO NO GOOGLE CLOUD STORAGE**

In [ ]:
#from google.cloud import storage
#import os
#import pandas as pd
#
## Only need this if you're running this code locally.
#os.environ['GOOGLE_APPLICATION_CREDENTIALS'] = '/content/drive/MyDrive/Soul_Code_Academy/repositorio_mini_projeto/mini-projeto-final-soul-victor-9eba120bf86d.json'
#
#client = storage.Client()
#bucket = client.get_bucket('bucket-mini-projeto-final-soulcode-victor')
#    
#bucket.blob('arquivo_tratado_pandas/marketing_campaign_tratado_pandas.csv').upload_from_string(df3.to_csv(sep=',', index=False), 'text/csv')